[
  {
    "role": "Applied Scientist Intern",
    "organisation": "New Territory Inc.",
    "startDate": "May, 2025",
    "endDate": "Present",
    "experiences": ["Developed intelligent LLM Agents integrated with multi-source Knowledge Bases and MCP servers, orchestrating retrieval and reasoning across connected systems to enhance contextual accuracy and responsiveness.", "Built knowledge base infrastructure managing over 25,000 documents with embedding generation and chunking, reducing end-to-end query latency to under 450 milliseconds.", "Fine-tuned LLaMA models using LoRA/QLoRA on AWS SageMaker, achieving domain-specific task improvements validated by over 45,000 custom instruction fine-tuning examples.", "Developed an LLM evaluation framework measuring nine critical dimensions including faithfulness and coherence, conducting over 50 evaluations to ensure deployment-quality model outputs.", "Designed and implemented AWS Glue ETL pipelines to process 40GB of multi-source legal datasets with 98% uptime."],
    "imageSrc": "assets/history/NewTerritoryInc.png"
  },
  {
    "role": "Software Engineer",
    "organisation": "HCL Technologies Ltd.",
    "startDate": "July, 2019",
    "endDate": "Dec, 2023",
    "experiences": ["Designed a process to hold trade cancellations, ensuring sync with clearing house reports, eliminating 100+ discrepancies annually, and enhancing compliance.", "Built a self-monitoring script to auto-cancel trades exceeding 30 days, reducing manual workload by 75% and ensuring compliance with detailed audit logs.", "Engineered a secure data backup pipeline, transferring 500GB of critical data monthly to AWS S3, cutting disaster recovery time by 60%, and ensuring 14-year secure storage for audits and investigations.", "Configured IBM MQ connections between SMAC and 5+ partner systems, improving message transmission reliability to 99.8% uptime, minimizing data loss, and ensuring seamless trade processing.", "Optimized the codebase to integrate Pound Sterling and Euro into corporate actions, enabling 1,000+ additional transactions monthly and expanding currency handling."],
    "imageSrc": "assets/history/hcl.png"
  },
  {
    "role": "Graduate Student Worker",
    "organisation": "Purdue University Fort Wayne",
    "startDate": "Sept, 2024",
    "endDate": "Present",
    "experiences": ["As the Students of Color Outreach Coordinator, I focus on fostering an inclusive community by directly engaging with and supporting students of color. My responsibilities include gathering and analyzing demographic data to better understand our student population, keeping campus communities informed by updating TV monitors with relevant content, and conducting outreach through emails and social media to ensure students of color feel connected, supported, and heard. Through these efforts, I strive to create an environment that embraces diversity and supports the unique experiences of every student."],
    "imageSrc": "assets/history/pfw.png"
  }
]
